ace-knu/autosar/mpc5606b/exercises/autron_autosar_edu_Warrior_mpc5606b_Base_R181026/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Gpt_freescale_MPC560xB/include/Reg_eSys_eMIOS_CfgEx.h
/**
*   @file    Reg_eSys_EMIOS_CfgEx.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Gpt - Brief file description (one line).
*   @details Detailed file description (can be multiple lines).
*
*   @addtogroup EMIOS_DRIVER
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : eMIOS_Stm_Pit_Rtc
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC560xB_MCAL_1_0_1_RTM_ASR_REL_4_0_REV_0003_20140606
*
*   (c) Copyright 2006-2014 Freescale Semiconductor Inc and STMicroelectronics
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/


/**
*
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_eMIOS_CfgEx_h_1
* Violates MISRA 2004 Required Rule 19.15, Precautions shall be taken in order to prevent the
* contents of a header file being included twice
* This is not a violation since all header files are protected against multiple inclusions
*
* @section Reg_eSys_eMIOS_CfgEx_h_2
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section Reg_eSys_eMIOS_CfgEx_h_3
* Violates MISRA 2004 Required Rule 1.4, The compiler/linker shall be checked to ensure 31 character
* significance and case sensitivity are supported for external identifiers.
* This is not a violation since all the compilers used interpret the identifiers correctly.
*
* @section Reg_eSys_eMIOS_CfgEx_h_4
* Violates MISRA 2004 Required Rule 20.2, This violation is not fixed since we have not used any
* Standard library macros.
*
*@section Reg_eSys_eMIOS_CfgEx_h_5
* Violates MISRA 2004 Required Rule 5.1, This violation is not fixed since naming convention of 
* identifiers(internal and external) are followed as per Autosar standards, some times which may
* exceeds more than 31 characters.
*/
#ifndef REG_ESYS_EMIOS_CFGEX_H
#define REG_ESYS_EMIOS_CFGEX_H

#ifdef __cplusplus
extern "C"{
#endif

/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_1 precautions to prevent the contents
*        of a header file being included twice
*/
#include "modules.h"
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_1 precautions to prevent the contents
*        of a header file being included twice
*/
#include "Reg_eSys.h"
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_1 precautions to prevent the contents
*        of a header file being included twice
*/
#include "Reg_Macros.h"

/*==================================================================================================
                               SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @brief   Header file version information
*/
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_VENDOR_ID                            43
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_AR_RELEASE_MAJOR_VERSION             4
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_3 The compiler/linker shall be checked to ensure 31 
* character  significance and case sensitivity are supported for external identifiers
*/
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_AR_RELEASE_MINOR_VERSION             0
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_3 The compiler/linker shall be checked to ensure 31 
* character  significance and case sensitivity are supported for external identifiers
*/
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_AR_RELEASE_REVISION_VERSION          3
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_SW_MAJOR_VERSION                     1
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_SW_MINOR_VERSION                     0
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_5 This is required as per autosar Requirement, 
*/
#define REG_ESYS_EMIOS_CFGEX_H_SW_PATCH_VERSION                     1

/*==================================================================================================
                                      FILE VERSION CHECKS
==================================================================================================*/

/* No checks needed as the included files ( Reg_eSys.h, Reg_Macros.h) do not define versions */


/*==================================================================================================
                                           CONSTANTS
==================================================================================================*/

/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/



/**
* @brief EMIOS channels defines
*/

