ace-knu/autosar/mpc5606b/exercises/autron_autosar_edu_Warrior_mpc5606b_Base_R181026/Static_Code/Modules/b_pf_mcal_freescale_MPC560xB/b_mcal_Gpt_freescale_MPC560xB/include/Reg_eSys_eMIOS_CfgEx.h
/*
 * EMIOS channel encoding
 *
 * [              3 bit | 5 bit                ]
 * [ module id: 7 ... 0 | channel id: 31 ... 0 ]
 */
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro, 
*/
#define EMIOS_MOD_MASK  ((uint8)0xE0)
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro, 
*/
#define EMIOS_MOD_SHIFT ((uint8)5U)
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro, 
*/
#define EMIOS_CH_MASK   ((uint8)0x1F)
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro, 
*/
#define EMIOS_CH_SHIFT  ((uint8)0U)


/** EMIOS module and channel decoding */
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_2 Function-like macro defined
*/
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro, 
*/
#define EMIOS_MODULE_INDEX(ch)      ((uint8)(((ch) & EMIOS_MOD_MASK) >> EMIOS_MOD_SHIFT))
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_2 Function-like macro defined
*/
/*
* @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro, 
*/
#define EMIOS_CHANNEL_INDEX(ch)     ((uint8)(((ch) & EMIOS_CH_MASK)  >> EMIOS_CH_SHIFT))

/**
* @brief EMIOS Channels defines
*/
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_0     ((uint8)0x00)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_1     ((uint8)0x01)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_2     ((uint8)0x02)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_3     ((uint8)0x03)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_4     ((uint8)0x04)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_5     ((uint8)0x05)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_6     ((uint8)0x06)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_7     ((uint8)0x07)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_8     ((uint8)0x08)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_9     ((uint8)0x09)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_10    ((uint8)0x0A)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_11    ((uint8)0x0B)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_12    ((uint8)0x0C)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_13    ((uint8)0x0D)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_14    ((uint8)0x0E)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_15    ((uint8)0x0F)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_16    ((uint8)0x10)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_17    ((uint8)0x11)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_18    ((uint8)0x12)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_19    ((uint8)0x13)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_20    ((uint8)0x14)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_21    ((uint8)0x15)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_22    ((uint8)0x16)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_23    ((uint8)0x17)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_24    ((uint8)0x18)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_25    ((uint8)0x19)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_26    ((uint8)0x1A)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_27    ((uint8)0x1B)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_28    ((uint8)0x1C)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_29    ((uint8)0x1D)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_30    ((uint8)0x1E)

/** @violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_CHANNEL_31    ((uint8)0x1F)

/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_0    (EMIOS_CHANNEL_0)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_1    (EMIOS_CHANNEL_1)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_2    (EMIOS_CHANNEL_2)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_3    (EMIOS_CHANNEL_3)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_4    (EMIOS_CHANNEL_4)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_5    (EMIOS_CHANNEL_5)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_6    (EMIOS_CHANNEL_6)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_7    (EMIOS_CHANNEL_7)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_8    (EMIOS_CHANNEL_8)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_9    (EMIOS_CHANNEL_9)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_10   (EMIOS_CHANNEL_10)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_11   (EMIOS_CHANNEL_11)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_12   (EMIOS_CHANNEL_12)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_13   (EMIOS_CHANNEL_13)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_14   (EMIOS_CHANNEL_14)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_15   (EMIOS_CHANNEL_15)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_16   (EMIOS_CHANNEL_16)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_17   (EMIOS_CHANNEL_17)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_18   (EMIOS_CHANNEL_18)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_19   (EMIOS_CHANNEL_19)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_20   (EMIOS_CHANNEL_20)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_21   (EMIOS_CHANNEL_21)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_22   (EMIOS_CHANNEL_22)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_23   (EMIOS_CHANNEL_23)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_24   (EMIOS_CHANNEL_24)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_25   (EMIOS_CHANNEL_25)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_26   (EMIOS_CHANNEL_26)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_27   (EMIOS_CHANNEL_27)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_28   (EMIOS_CHANNEL_28)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_29   (EMIOS_CHANNEL_29)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_30   (EMIOS_CHANNEL_30)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_0_CH_31   (EMIOS_CHANNEL_31)
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_0    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_0))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_1    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_1))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_2    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_2))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_3    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_3))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_4    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_4))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_5    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_5))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_6    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_6))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_7    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_7))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_8    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_8))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_9    ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_9))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_10   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_10))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_11   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_11))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_12   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_12))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_13   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_13))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_14   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_14))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_15   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_15))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_16   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_16))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_17   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_17))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_18   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_18))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_19   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_19))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_20   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_20))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_21   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_21))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_22   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_22))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_23   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_23))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_24   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_24))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_25   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_25))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_26   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_26))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_27   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_27))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_28   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_28))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_29   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_29))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_30   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_30))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_1_CH_31   ((uint8)((uint8)(1U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_31))

/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_0    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_0))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_1    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_1))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_2    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_2))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_3    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_3))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_4    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_4))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_5    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_5))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_6    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_6))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_7    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_7))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_8    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_8))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_9    ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_9))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_10   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_10))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_11   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_11))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_12   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_12))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_13   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_13))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_14   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_14))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_15   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_15))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_16   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_16))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_17   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_17))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_18   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_18))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_19   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_19))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_20   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_20))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_21   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_21))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_22   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_22))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_23   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_23))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_24   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_24))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_25   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_25))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_26   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_26))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_27   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_27))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_28   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_28))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_29   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_29))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_30   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_30))
/**@violates @ref Reg_eSys_eMIOS_CfgEx_h_4 This is not a standard library macro */
#define EMIOS_2_CH_31   ((uint8)((uint8)(2U<<EMIOS_MOD_SHIFT) + EMIOS_CHANNEL_31))
/*==================================================================================================
                                             ENUMS
==================================================================================================*/

/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/


#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_EMIOS_CFGEX_H */
/** @} */
